name: "intent_classifier"
backend: "python"
max_batch_size: 8

input [
  {
    name: "text"
    data_type: TYPE_STRING
    dims: [ 1 ]    # Each input is a single string
  }
]

output [
  {
    name: "intents"
    data_type: TYPE_STRING
    dims: [ -1 ]   # Variable length array of strings
  },
  {
    name: "probabilities"
    data_type: TYPE_FP32
    dims: [ 10 ]   # Fixed size for 10 intent classes
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU
    gpus: [0]
  }
]